# Ultralytics 🚀 AGPL-3.0 License

# YOLO12 two-stream instance segmentation model (RGB + Depth)
# P3/8 - P5/32 outputs

nc: 18  # number of classes

scales:
 # n: [0.50, 0.25, 1024]
 # s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
 # l: [1.00, 1.00, 512]
 # x: [1.00, 1.50, 512]

# ================================
#    BACKBONE (Two-Stream)
# ================================
backbone:
  # ------- RGB Stream -------
  - [-1, 1, Focus, [64, 3, 2]]        # 0
  - [-1, 1, Conv, [128, 3, 2]]       # 1
  - [-1, 2, C3k2, [256, False, 0.25]]# 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]# 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]  # 8

  # ------- Depth Stream -------
  - [-4, 1, Focus, [64, 3, 2]]        # 9
  - [-1, 1, Conv, [128, 3, 2]]       # 10
  - [-1, 2, C3k2, [256, False, 0.25]]# 11
  - [-1, 1, Conv, [256, 3, 2]]       # 12-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]# 13
  - [-1, 1, Conv, [512, 3, 2]]       # 14-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]   # 15
  - [-1, 1, Conv, [1024, 3, 2]]      # 16-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]  # 17

  # ------- Add Fusion: RGB + Depth -------
  - [[2, 11], 1, Add, [1]]           # 18  P2/4
  - [[4, 13], 1, Add, [1]]           # 19  P3/8
  - [[6, 15], 1, Add, [1]]           # 20  P4/16
  - [[8, 17], 1, Add, [1]]           # 21  P5/32

# ================================
#             HEAD
# ================================
head:
  - [21, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]        # 24

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]        # 27 (P3 small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]        # 30 (P4 medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 21], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]             # 33 (P5 large)

  # -------- Segment Head --------
  - [[27, 30, 33], 1, Segment, [nc, 32, 256]]   # final seg head