# Ultralytics 🚀 YOLO11n-seg Two-Stream Version (scale = m)
# yolo11n two-stream instance segmentation (P3/P4/P5 outputs)
# nc: number of classes (set to your dataset classes)

# YOLO11m-two-stream-seg

nc: 18
task: segment
scales:
  m: [0.50, 1.00, 512]

backbone:

  # -------- Stream A (RGB) --------
  - [-1, 1, Conv, [128, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [256, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SPPF, [512, 5]]           # 9
  - [-1, 2, C2PSA, [512]]             # 10

  # -------- Stream B (Depth) 复制 backbone --------
  - [-4, 1, Conv, [128, 3, 2]]       # 11-P1/2
  - [-1, 1, Conv, [256, 3, 2]]        # 12-P2/4
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]        # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]        # 16-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]        # 18-P5/32
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SPPF, [512, 5]]           # 20
  - [-1, 2, C2PSA, [512]]             # 21

  # -------- Add fusion (像 YOLOv8 两流一样) --------
  - [[3, 14], 1, SDI, [1]]            # 22 - P3 fusion
  - [[5, 16], 1, SDI, [1]]            # 23 - P4 fusion
  - [[9, 20], 1, SDI, [1]]            # 24 - P5 fusion

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]       # 27

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 22], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]       # 30

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 27], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]       # 33

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 24], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]        # 36

  - [[30, 33, 36], 1, Segment, [nc, 32, 256]]